GENDER_ENDINGS = {
    'ил': {'м': 'ил', 'ж': 'ила', 'оно': 'ило', 'не указан': 'ил'},
    'ал': {'м': 'ал', 'ж': 'ала', 'оно': 'ало', 'не указан': 'ал'},
    'ял': {'м': 'ял', 'ж': 'яла', 'оно': 'яло', 'не указан': 'ял'},
    'ыл': {'м': 'ыл', 'ж': 'ыла', 'оно': 'ыло', 'не указан': 'ыл'},
    'ол': {'м': 'ёл', 'ж': 'ла', 'оно': 'ло', 'не указан': 'ёл'},
    'ен': {'м': 'ен', 'ж': 'ена', 'оно': 'ено', 'не указан': 'ен'},
    'ан': {'м': 'ан', 'ж': 'ана', 'оно': 'ано', 'не указан': 'ан'},
    'ён': {'м': 'ён', 'ж': 'ена', 'оно': 'ено', 'не указан': 'ён'},
    'ёг': {'м': 'ён', 'ж': 'гла', 'оно': 'гло', 'не указан': 'ёг'},
    'ёс': {'м': 'ёс', 'ж': 'есла', 'оно': 'есло', 'не указан': 'ёс'},
    'был': {'м': 'был', 'ж': 'была', 'оно': 'было', 'не указан': 'был'},
    'его': {'м': 'его', 'ж': 'её', 'оно': 'его', 'не указан': 'его'},
    'он': {'м': 'он', 'ж': 'она', 'оно': 'оно', 'не указан': 'он'},
    'лся': {'м': 'лся', 'ж': 'лась', 'оно': 'лось', 'не указан': 'лся'},
    'ул': {'м': 'ул', 'ж': 'ула', 'оно': 'уло', 'не указан': 'ул'},
    'ас': {'м': 'ас', 'ж': 'асла', 'оно': 'асло', 'не указан': 'ас'},



    'пол': {'м': 'мужской', 'ж': 'женский', 'оно': 'транс', 'не указан': 'не указано'},
    'пол_эмод': {'м': '🤵🏻‍♂️', 'ж': '🤵🏻‍♀️', 'оно': '🤵🏻', 'не указан': '❓'}
}

def g(ending: str, gender: str) -> str:
    """Просто возвращает окончание для гендера"""
    return GENDER_ENDINGS.get(ending, {}).get(gender, GENDER_ENDINGS.get(ending, {}).get('м', ending))